In [1]:
!apt-get install y- sqlite3

Reading package lists... Done
Building dependency tree... Done
Reading state information... Done
E: Unable to locate package y

In [2]:
import sqlite3

In [3]:
#connect with database
conn=sqlite3.connect('Graygraph_Sales.db')

In [4]:
cursor=conn.cursor()

In [5]:
cursor.execute('''
    CREATE TABLE sales_info(
      id INTEGER PRIMARY KEY,
      name TEXT,
      team TEXT,
      members INTEGER,
      total_sales INTEGER
    )''')

In [6]:
cursor.execute("INSERT INTO sales_info (name,team,members,total_sales) VALUES ('Akarsh','Phoenix',5,2852)")
cursor.execute("INSERT INTO sales_info (name,team,members,total_sales) VALUES ('Harsh','Harsh',5,3160)")
cursor.execute("INSERT INTO sales_info (name,team,members,total_sales) VALUES ('Tom','Titans',5,2952)")
cursor.execute("INSERT INTO sales_info (name,team,members,total_sales) VALUES ('Dustin','Dustin',6,3450)")
cursor.execute("INSERT INTO sales_info (name,team,members,total_sales) VALUES ('Sonali','Sonali',5,2851)")
cursor.execute("INSERT INTO sales_info (name,team,members,total_sales) VALUES ('Rahil','Rulers',5,2800)")
cursor.execute("INSERT INTO sales_info (name,team,members,total_sales) VALUES ('Deepak','Warriors',5,2492)")
cursor.execute("INSERT INTO sales_info (name,team,members,total_sales) VALUES ('Shubham','Rangers',5,1551)")
cursor.execute("INSERT INTO sales_info (name,team,members,total_sales) VALUES ('Ethan','Alpha',6,1252)")

In [7]:
cursor.execute('SELECT * FROM sales_info')

In [8]:
rows=cursor.fetchall()

for row in rows:
  print(row)

(1, 'Akarsh', 'Phoenix', 5, 2852)
(2, 'Harsh', 'Harsh', 5, 3160)
(3, 'Tom', 'Titans', 5, 2952)
(4, 'Dustin', 'Dustin', 6, 3450)
(5, 'Sonali', 'Sonali', 5, 2851)
(6, 'Rahil', 'Rulers', 5, 2800)
(7, 'Deepak', 'Warriors', 5, 2492)
(8, 'Shubham', 'Rangers', 5, 1551)
(9, 'Ethan', 'Alpha', 6, 1252)

In [9]:
# Execute a SELECT query with a WHERE clause to filter rows where members are more than 5
cursor.execute("SELECT * FROM sales_info WHERE members>5")

# Fetch all the rows from the cursor
rows = cursor.fetchall()

# Print the rows
for row in rows:
    print(row)

(4, 'Dustin', 'Dustin', 6, 3450)
(9, 'Ethan', 'Alpha', 6, 1252)

In [10]:
# Execute a SELECT query with a WHERE clause to filter rows where their sales is greater than 2000

cursor.execute("SELECT * FROM sales_info WHERE total_sales>2000")

rows=cursor.fetchall()

for row in rows:
    print(row)

(1, 'Akarsh', 'Phoenix', 5, 2852)
(2, 'Harsh', 'Harsh', 5, 3160)
(3, 'Tom', 'Titans', 5, 2952)
(4, 'Dustin', 'Dustin', 6, 3450)
(5, 'Sonali', 'Sonali', 5, 2851)
(6, 'Rahil', 'Rulers', 5, 2800)
(7, 'Deepak', 'Warriors', 5, 2492)

In [11]:
# Execute a SELECT query with a WHERE clause to filter rows where their sales is less than 2000

cursor.execute("SELECT * FROM sales_info WHERE total_sales<2000")

rows=cursor.fetchall()

for row in rows:
    print(row)

(8, 'Shubham', 'Rangers', 5, 1551)
(9, 'Ethan', 'Alpha', 6, 1252)

In [12]:
# To get the Schema of the table

cursor.execute("PRAGMA table_info(sales_info)")

rows=cursor.fetchall()

for row in rows:
    print(row)

(0, 'id', 'INTEGER', 0, None, 1)
(1, 'name', 'TEXT', 0, None, 0)
(2, 'team', 'TEXT', 0, None, 0)
(3, 'members', 'INTEGER', 0, None, 0)
(4, 'total_sales', 'INTEGER', 0, None, 0)

In [13]:
# Find out all the unique name records. # distinct function remove duplicates and give unique values

cursor.execute("SELECT DISTINCT name FROM sales_info")

rows=cursor.fetchall()

for row in rows:
    print(row)

('Akarsh',)
('Harsh',)
('Tom',)
('Dustin',)
('Sonali',)
('Rahil',)
('Deepak',)
('Shubham',)
('Ethan',)

In [14]:
# Write a query to retrieve all the details where first name from employee table which starts with 'D'

cursor.execute("SELECT * FROM sales_info WHERE name LIKE 'D%'")

rows=cursor.fetchall()

for row in rows:
    print(row)

(4, 'Dustin', 'Dustin', 6, 3450)
(7, 'Deepak', 'Warriors', 5, 2492)

In [15]:
# Write a query to print all the details of the employee whose bonus between 2000 to 3000

cursor.execute("SELECT * FROM sales_info WHERE total_sales BETWEEN 2000 AND 3000")

rows=cursor.fetchall()

for row in rows:
    print(row)

(1, 'Akarsh', 'Phoenix', 5, 2852)
(3, 'Tom', 'Titans', 5, 2952)
(5, 'Sonali', 'Sonali', 5, 2851)
(6, 'Rahil', 'Rulers', 5, 2800)
(7, 'Deepak', 'Warriors', 5, 2492)

In [16]:
# Write a query to retrieve all the details where name from employee table which ends with 'h'

cursor.execute("SELECT * FROM sales_info WHERE name LIKE '%h'")

rows=cursor.fetchall()

for row in rows:
    print(row)

(1, 'Akarsh', 'Phoenix', 5, 2852)
(2, 'Harsh', 'Harsh', 5, 3160)

In [23]:
# show the data of team and and their members only

cursor.execute("SELECT team, members FROM sales_info")

rows=cursor.fetchall()

for row in rows:
    print(row)

('Phoenix', 5)
('Harsh', 5)
('Titans', 5)
('Dustin', 6)
('Sonali', 5)
('Rulers', 5)
('Warriors', 5)
('Rangers', 5)
('Alpha', 6)

In [24]:
# Write a SQL Query to determine 4th highest sales

cursor.execute("SELECT * FROM sales_info ORDER BY total_sales DESC LIMIT 3,1")

rows=cursor.fetchall()

for row in rows:
    print(row)

(1, 'Akarsh', 'Phoenix', 5, 2852)

In [25]:
# Write a SQL Query to find out sales in decrement order

cursor.execute("SELECT * FROM sales_info ORDER BY total_sales DESC")

rows=cursor.fetchall()

for row in rows:
    print(row)

(4, 'Dustin', 'Dustin', 6, 3450)
(2, 'Harsh', 'Harsh', 5, 3160)
(3, 'Tom', 'Titans', 5, 2952)
(1, 'Akarsh', 'Phoenix', 5, 2852)
(5, 'Sonali', 'Sonali', 5, 2851)
(6, 'Rahil', 'Rulers', 5, 2800)
(7, 'Deepak', 'Warriors', 5, 2492)
(8, 'Shubham', 'Rangers', 5, 1551)
(9, 'Ethan', 'Alpha', 6, 1252)